      ******************************
      * Author:Gustavo Rebelo Godoy
      * Date:26/10/2024
      * Purpose:
      * Tectonics: cobc
      ******************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM HelloWorld.
