      ******************************************
      *
       IDENTIFICATION DIVISION.
        PROGRAM-ID. ANOTAR_AULA.
        AUTHOR.
      *******************************************
       ENVIRONMENT DIVISION.
        CONFIGURATION SECTION.
         SPECIAL-NAMES.
          DECIMAL-POINT IS COMMA.
       DATA DIVISION.
        WORKING-STORAGE.

       PROCEDURE DIVISION.

       0001-PRINCIPAL.
       0100-INICIALIZAR.
       0200-PROCESSAR.
       0400-FINALIZAR.
