      ******************************************
      *IDENTIFICATION DIVISION É OBRIGATÓRIO
       IDENTIFICATION DIVISION.
        PROGRAM-ID. ANOTAR_AULA.
        AUTHOR. GUSTAVO.
        DATE-WRITTEN. 14/09/2024.
        REMARKS. COMENTARIOS DIVERSOS.
      *******************************************
       ENVIRONMENT DIVISION.
        CONFIGURATION SECTION.
         SPECIAL-NAMES.
          DECIMAL-POINT IS COMMA.
        INPUT-OUTPUT SECTION.
         FILE-CONTROL.
       DATA DIVISION.
        WORKING-STORAGE SECTION.
       01 WRK-SIMBOLOS.
        02 WRK-NUMERO     PIC 9(003) VALUE ZEROES.
        02 WRK-CARACTERE  PIC X(003) VALUE SPACES.


       PROCEDURE DIVISION.

       0001-PRINCIPAL.
           PERFORM 0100-INICIALIZAR.
           IF WRK-NUMERO > 0
               PERFORM 0200-PROCESSAR.
           PERFORM 0400-FINALIZAR.

           STOP RUN.

       0100-INICIALIZAR.
           ACCEPT WRK-NUMERO.
       0200-PROCESSAR.
       0400-FINALIZAR.
