       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB13.
      ***************************
      *AREA DE COMENTARIOS - REMARKS
      *AUTHOR = GUSTAVO REBELO
      *OBJETIVO: RECEBER UM NIMERO E GERAR TABUADA DE 1 A 10
      *UTILIZAR PERFORM
      *DATA = 25/08/2024
      ***************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NUMERO       PIC 9(02)  VALUE ZEROS.
       77 WRK-CONTADOR     PIC 9(02)  VALUE 1.
       77 WRK-RESULT       PIC 9(02)  VALUE ZEROS.

       PROCEDURE DIVISION.
       0001-PRINCIPAL.
           PERFORM 0100-INICIALIZAR.
           IF WRK-NUMERO > 0
               PERFORM 0200-PROCESSAR
           PERFORM 0300-FINALIZAR

           STOP RUN.

       0100-INICIALIZAR.
           ACCEPT WRK-NUMERO.

       0200-PROCESSAR.
           PERFORM 10 TIMES
               COMPUTE WRK-RESULT = WRK-NUMERO * WRK-CONTADOR
           DISPLAY WRK-NUMERO ' X ' WRK-CONTADOR ' = ' WRK-RESULT
           ADD 1 TO WRK-CONTADOR
           END-PERFORM.

       0300-FINALIZAR.
           DISPLAY '------------------'.
           DISPLAY 'FINAL DE PROCESSAMENTO'.
