       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB03.
      ***************************
      *AREA DE COMENTARIOS - REMARKS
      *AUTHOR = GUSTAVO REBELO
      *OBJETIVO: RECEBER E IMPRIMIR A DATA DO SISTEMA
      *UTILIZAR VARIAVEIS 01,02 (ESTRUTURADA)
      *DATA = 21/08/2024
      ***************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WRK-DATA.
           02 WRK-ANO PIC 9(04) VALUE ZEROS.
           02 WRK-MES PIC 9(02) VALUE ZEROS.
           02 WRK-DIA PIC 9(02) VALUE ZEROS.

       PROCEDURE DIVISION.
           ACCEPT WRK-DATA FROM DATE YYYYMMDD.
           DISPLAY 'DATA: ' WRK-DIA '/'WRK-MES '/' WRK-ANO.
           STOP RUN.
