       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB06.
      ***************************
      *AREA DE COMENTARIOS - REMARKS
      *AUTHOR = GUSTAVO REBELO
      *OBJETIVO: USO DO SINAL (- +)
      *DATA = 24/08/2024
      ***************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NUM1      PIC 9(02) VALUE ZEROS.
       77 WRK-NUM2      PIC 9(02) VALUE ZEROS.
       77 WRK-RESULT    PIC S9(04) VALUE ZEROS.
       77 WRK-RESULT-ED PIC -ZZ9 VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-NUM1 FROM CONSOLE.
           ACCEPT WRK-NUM2 FROM CONSOLE.
           DISPLAY '======================'.
           DISPLAY 'NUMERO1: ' WRK-NUM1.
           DISPLAY 'NUMERO2: ' WRK-NUM2.

      *************** SUBTRACAO
           SUBTRACT WRK-NUM2 FROM WRK-NUM1 GIVING WRK-RESULT.
           MOVE WRK-RESULT TO WRK-RESULT-ED.
           DISPLAY 'SUBTRACAO: ' WRK-RESULT.
           DISPLAY 'SUBTRACAO: ' WRK-RESULT-ED.

           STOP RUN.
