       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
      ***************************
      *AREA DE COMENTARIOS - REMARKS
      *AUTHOR = GUSTAVO REBELO
      *OBJETIVO: MOSTRAR STRING HELLO WORLD
      *DATA = 20/08/2024
      ***************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORLD'.
           STOP RUN.
